// 1. შექმენით 5 ელემენტიანი სია, სიიდან ამოშალეთ ბოლო ელემენტი და ჩაამატეთ ახალი ელემენტი.

listn = [1,2,3,4,5]

listn.pop()

listn.push("Last")

console.log(listn)

// 2. შექმენით 5 ელემენტიანი სია,  სიიდან ამოშალეთ მე-0 ინდექსზე მდგომი ელემენტი და დაამატეთ ახალი ელემენტი მის მაგივრად.

listn2 = [1,2,3,4,5]

listn2.splice(0, 1, "New") // ამოვშალეთ 0 შემდეგ დავამატეთ 1, "New"

console.log(listn2)

// 3. შექმენით 5 ელემენტიანი სია, მომხმარებლის შემოტანილი მნიშვნელობა დაამატეთ ამ სიაში იმ შემთხვევაში თუ ეს ელემენტი არ არის სიაში, თუ არის მაშინ ამოშალეთ. და კონსოლში გამოიტანეთ ახალი სია. 

listn3 = [1,2,3,4,5]

let user = Number(prompt("Enter your number: "))

if(listn3 === user) {
    delete listn3[user]
} else {
    listn.push(user)
}

// 4. შექმენით  10 ელემენტიანი სია. მომხმარებელს შემოატანინეთ რიცხვი, შემოტანილი რიცხვი გამოიყენეთ როგორც ინდექსად და მომდევნო სამი ელემენტი წაშალეთ. შედეგი გამოიტანეთ კონსოლში.

let listn4 = [1,2,3,4,5,6,7,8,9,10]

let index = Number(prompt("Enter your index: "))

listn4.splice(index, 3)

console.log(listn4)

// 5. შექმენით 10 ელემენტიანი სია. მე-2 ინდექსზე მყოფი ელემენტი შეცვალეთ თქვენი სახელით, და მე-6დან მე-8 ინდექსის ჩათვლით ელემენტები წაშალეთ და ჩასვით 'Goa academy'

let listn5 = [1,2,3,4,5,6,7,8,9,10]
listn5[2] = "Zuka"
listn5.splice(6, 3, "Goa academy")
console.log(listn5)

// 6. შექმენით 3 ელემენტიანი სია. სიის ბოლოდან ამოშალეთ ბოლო ელემენტი.

let listn6 = [1,2,3]
listn6.pop()
console.log(listn6)

// 7. შექმენით 3 ელემენტიანი სია და სიის დასაწყისიდან ამოშალეთ ელემენტი

let listn7 = [1,2,3]
listn7.shift()
console.log(listn7)

// 8. შექმენით 3 ელემენტიანი სია და სიის დასაწყისში ჩაამათეთ რიცხვი.

let listn8 = [1,2,3]
listn8.push(0)

// 9. შექმენით 3 ელემენტიანი სია და სიის ბოლოში დაამატეთ ნებისმიერი სტრინგი.

let listn9 = [1,2,3]
listn9.push("Hello")

// 10. მოცემული გაქვთ სია: 
//       [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120]

//       შესაბამისი მეთოდების გამოყენებით გამოიტანეთ
//       *. 40 - ის ინდექსები ;
//       *. 30 - ის ინდექსი ;


let arr = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 40, 50, 110, 120]

for(let i = 0; i < arr.length; i++) {
    console.log(arr[i])
}