// 1. მომხმარებელს შემოატანინე რიცხვი.
// თუ რიცხვი იყოფა 2-ზე და არ იყოფა 5-ზე, კონსოლში დაწერე "რიცხვი ლუწია და არა 5-ის ჯერადი",
// სხვა შემთხვევაში "სხვა შემთხვევა"


// const num = Number(prompt("Enter number"))
// if(num %2 === 0 && num %5 !== 0) {
//     console.log("ლუწია და არა 5 ის ჯერადი")
// }else {
//     console.log("სხვა შემთხვევა")
// }


// 2. მომხმარებელს შეეკითხე ქულა (0–100).
// თუ ქულა 90-ზე მეტია → "შესანიშნავი!"
// თუ 70–90 შორისაა → "კარგია!"
// თუ 50–70 შორისაა → "საშუალო შედეგი!"
// თუ ნაკლებია 50-ზე → "მეტი უნდა იმეცადინო!"


// const memberScore = Number(prompt("whats your score to 0-100 ?"))
// if(memberScore > 90) {
//     console.log("შესანიშნავი!")
// } else if(memberScore > 70 && memberScore < 90) {
//     console.log("კარგია!")
// } else if(memberScore > 50 && memberScore < 70) {
//     console.log("საშუალო შედეგი!")
// } else {
//     console.log("მეტი უნდა იმეცადინო!")
// }

// 3. შეიყვანე ორი სიტყვა prompt-ით.
// თუ ტოლია — "სიტყვები ემთხვევა",
// თუ მხოლოდ პირველი ასოები ემთხვევა მაშინ - “პირველი ასოები ემთხვევა”
// სხვა შემთხვევაში — "არ ემთხვევა".

const firstWord = prompt("Enter first word")
const secondWord = prompt("Enter second word")

if(firstWord == secondWord) {
    console.log("სიტყვები ემთხვევა")
}else if(firstWord[0] == secondWord[0]) {
    console.log("პირველი ასოები ემთხვევა")
} else {
    console.log("არ ემთხვევა")
}

// 4. შეიყვანე ასაკი და ენერგიის დონე (1–10).
// თუ ასაკი 20-ზე ნაკლებია და ენერგია მეტია 7-ზე → "გირჩევ სირბილს!",
// თუ ენერგია ნაკლებია 4-ზე → "გირჩევ დასვენებას!",
// სხვა შემთხვევაში → "გააგრძელე ჩვეულებრივად!"

// 5. შეიყვანე რიცხვი 1–10.
// თუ ტოლია 7-ის ან 3-ის → "გაიმარჯვე!",
// თუ მეტი 8-ზე → "ძალიან მაღალი!",
// თუ ნაკლებია 2-ზე → "ძალიან დაბალია!",
// სხვა შემთხვევაში → "ცადე კიდევ!".