// 1)დაატრიალეთ for ციკლი 0 იდან 20 მდე  და კონსოლში გამოიტანე თიოეული რიცხვი
 
for(let i = 0; i < 20; i++) {
    console.log(i)
}

// 2)დაატრიალეთ for ციკლი 5 იდან 50 მმდე  და კონსოლში გამოიტანე თიოეული რიცხვი

for(let i = 5; i < 50; i++) {
    console.log(i)
}


// 3)დაატრიალეთ for ციკლი 10 იდან 100 მდე 5 ის გამოტოვებით და კონსოლში გამოიტანე თიოეული რიცხვი

for(let i = 10; i < 100; i+=5) {
    console.log(i)
}

// 4)ფორ ციკლის დახმარებით კონსოლში გამოიტანეთ თქვენი სახელი 20 ჯერ

for(let i = 0; i < 20; i++) {
    console.log("ზუკა")
}


// 5)დაატრიალეთ ფორ ციკლი 20 ჯერთქვენიდ ავალებაა რომ გამოიტანოთ ასეთი რამ -->

// girogi1
// girogi2
// girogi3
// giorgi4
// ....
// giorgi20

for(let i = 0; i < 20; i++) {
    console.log(`Zuka${i}`)
}


// 6)შექმენი ცვლადი სადაც შეინახავ ნამბერ ტიპის მონაცემს,თქვენი დავალებაა რომ 0 იდან ამ რიცხვამდე რაც ცვლადში შეინახეთ დაატრიალოთ ფორ ციკლი და კონსოლში გმოიტანოთ ეს რიცხვები

let Mynum = 20;

for(let i = 0; i < Mynum; i++) {
    console.log(i)
}


// 7)შექმენი 2 ცვლადი სადაც შეინხავ ნამბერ ტიპის მონაცემს,თქვენი დავალებაა რომ ფორ ციკლი დაატროალი პირველი რიცხვიდან(რაც ცვლადში გაქვთ) მეორე რიცხვამდე(რაც მეორე ცვლადში გაქვთ) და გამოიტანოთ  რიცხვები კონსოლში

let Mynum1 = 10;
let Mynum2 = 30;

for(let i = Mynum1; Mynum1 < Mynum2; i++) {
    console.log(i)
}


// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა რიცვხვი.


const User = Number(prompt("Enter number"))
for(let i = 0; i < User; i++) {
    console.log(i)
}


// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვის ჩათვლით გამოიტანეთ ყველა ლუწი რიცხვი

const User2 = Number(prompt("Enter number"))

for(let i = 0; i < User2; i++){
    if(i % 2 === 0){
        console.log(i)
    } else {
        console.log("არ არის")
    }
}

// მომხმარებელს შემოატანინეთ რიცხვი და ამ რიცხვიდან 0-მდე გამოიტანეთ ყველა რიცხვი

const User3 = Number(prompt("Enter number"))
for(let i = 0; i < User3; i--) {
    console.log(i)
}
