// 1) შექმენით ფუნქცია რომელიც დააბრუნებს "გამარჯობა {თქვენი სახელი}"-ს და კონსოლში გამოიტანეთ შედეგი.

function greet(name){
    console.log("Hello", name)
}
greet("Zuka")

// 2) შექმენით ფუნქცია, რომელსაც გადაეცემა თქვენი სახელი და ასაკი, და დააბრუნეთ ტექსტი 'გამარჯობა, მე ვარ {სახელი}, და ვარ {ასაკი} წლის. შენ რამდენის ხარ? '

// ფუნქციას რომ შექმნით გამოიძახეთ 3-ჯერ, კონსოლში გამოჩნდეს შედეგი და სხვადასხვა მნიშვნელობა გადაეცით

function greet2(name, age){
    console.log(`გამარჯობა, მე ვარ ${name}, და ვარ ${age} წლის. შენ რამდენის ხარ?`)
}
greet2("Zuka", 16)
greet2("Gio", 30)
greet2("Saba", 10)